<?php
// +----------------------------------------------------------------------
// | Electronic Commerce [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 米糕网络团队<13052079525> All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 米糕网络团队<13052079525>
// +----------------------------------------------------------------------
// | Author: 米糕网络团队 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace App\Common\FieldMapping;

class AlbumPic
{

    public static $id = 'id';
 // 图片编号
    public static $picName = 'pic_name';
 // 图片名称
    public static $albId = 'alb_id';
 // 相册id
    public static $picPath = 'pic_path';
 // 图片路径
    public static $picSize = 'pic_size';
 // 图片大小
    public static $picMeasure = 'pic_measure';
 // 图片尺寸
    public static $picType = 'pic_type';
 // 图片类型
    public static $picSort = 'pic_sort';
 // 排序
    public static $isCover = 'is_cover';
 // 是否为封面 1为是 0为否
    public static $createTime = 'create_time'; // 上传时间
}