<?php
// +----------------------------------------------------------------------
// | Electronic Commerce [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 米糕网络团队<13052079525> All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 米糕网络团队<13052079525>
// +----------------------------------------------------------------------
// | Author: 米糕网络团队 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace App\Common\FieldMapping;

class Express
{

    public static $id = 'id';
 // 索引ID
    public static $name = 'name';
 // 公司名称
    public static $status = 'status';
 // 是否启用【状态1启用 0弃用】
    public static $code = 'code';
 // 编码
    public static $letter = 'letter';
 // 首字母
    public static $order = 'order';
 // 是否常用【1常用0不常用】
    public static $url = 'url';
 // 公司网址
    public static $ztState = 'zt_state';
 // 是否支持服务站配送【0否1是】
    public static $tel = 'tel';
 // 客服电话
    public static $discount = 'discount'; // 折扣
}