<?php
// +----------------------------------------------------------------------
// | Electronic Commerce [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 米糕网络团队<13052079525> All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 米糕网络团队<13052079525>
// +----------------------------------------------------------------------
// | Author: 米糕网络团队 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace App\Common\FieldMapping;

class Freights
{

    public static $id = 'id';
 // id
    public static $expressTitle = 'express_title';
 // 运费模板名称
    public static $sendTime = 'send_time';
 // 发货时间【几个小时内发货】
    public static $isFree_shipping = 'is_free_shipping';
 // 运费类型【0自定义运费1卖家包邮】
    public static $valuationMethod = 'valuation_method';
 // 计价方式【0:按件 1:按重量 2:按体积】
    public static $isSelect_condition = 'is_select_condition';
 // 是否指定条件包邮 【0=>false 1=>true】
    public static $stockId = 'stock_id';
 // 关联仓库
    public static $updateTime = 'update_time';
 // 更新时间
    public static $createTime = 'create_time';
 // 创建时间
    public static $storeId = 'store_id'; // 商户【编号】
}