<?php
// +----------------------------------------------------------------------
// | Electronic Commerce [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 米糕网络团队<13052079525> All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 米糕网络团队<13052079525>
// +----------------------------------------------------------------------
// | Author: 米糕网络团队 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace App\Common\FieldMapping;

class FreightMode
{

    public static $id = 'id';
 // ID
    public static $freightId = 'freight_id';
 // 运费模板【编号】
    public static $firstThing = 'first_thing';
 // 首件
    public static $firstWeight = 'first_weight';
 // 首重
    public static $fristVolum = 'frist_volum';
 // 首体积
    public static $fristMoney = 'frist_money';
 // 首运费【起步价】
    public static $continuedHeavy = 'continued_heavy';
 // 续重
    public static $continuedVolum = 'continued_volum';
 // 续体积
    public static $continuedMoney = 'continued_money';
 // 续费
    public static $carryWay = 'carry_way';
 // 运送方式编号【多商户废弃】
    public static $continuedThing = 'continued_thing';
 // 续件
    public static $storeId = 'store_id'; // 店铺【id】
}