<?php
// +----------------------------------------------------------------------
// | Electronic Commerce [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 米糕网络团队<13052079525> All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 米糕网络团队<13052079525>
// +----------------------------------------------------------------------
// | Author: 米糕网络团队 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace App\Common\FieldMapping;

class HelpType
{

    public static $id = 'id';
 // 类型ID
    public static $name = 'name';
 // 类型名称
    public static $sort = 'sort';
 // 排序
    public static $helpCode = 'help_code';
 // 调用编号【auto的可删除】
    public static $status = 'status';
 // 是否显示【0为否,1为是,默认为1】
    public static $pageShow = 'page_show';
 // 页面类型【0为店铺,1为会员】
    public static $updateTime = 'update_time';
 // 更新时间
    public static $createTime = 'create_time';
 // 创建时间
    public static $pId = 'p_id'; // 父及编号
}