<?php
// +----------------------------------------------------------------------
// | Electronic Commerce [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 米糕网络团队<13052079525> All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 米糕网络团队<13052079525>
// +----------------------------------------------------------------------
// | Author: 米糕网络团队 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace App\Common\FieldMapping;

class IntegralGoods
{

    public static $id = 'id';
 //
    public static $goodsId = 'goods_id';
 // 商品ID
    public static $integral = 'integral';
 // 需要的积分
    public static $delayed = 'delayed';
 // 积分最少被领取时间【最少0,最大999】
    public static $status = 'status';
 // 是可兑换
    public static $createTime = 'create_time';
 // 创建时间
    public static $money = 'money';
 // 金额【换取商品需要另外添加的钱】
    public static $updateTime = 'update_time';
 // 修改时间
    public static $storeId = 'store_id';
 // 店铺【id】
    public static $isShow = 'is_show'; // 是否显示【1显示 0不显示】
}