<?php
// +----------------------------------------------------------------------
// | Electronic Commerce [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 米糕网络团队<13052079525> All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 米糕网络团队<13052079525>
// +----------------------------------------------------------------------
// | Author: 米糕网络团队 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace App\Common\FieldMapping;

class Pay
{

    public static $id = 'id';

    // 编号
    public static $payType_id = 'pay_type_id';

    // 支付类型【编号】
    public static $payAccount = 'pay_account';

    // 支付账号或APP_ID
    public static $mchid = 'mchid';

    // 受理人编号或收款方支付宝账号【一般情况下与合作这身份id一样】
    public static $payKey = 'pay_key';

    // 支付秘钥
    public static $openId = 'open_id';

    // 微信openID
    public static $createTime = 'create_time';

    // 创建时间
    public static $updateTime = 'update_time';

    // 更新时间
    public static $type = 'type';

    // 设备类型 0pc 1 wap 2 app 3 微商城
    public static $privatePem = 'private_pem';

    // 私钥
    public static $publicPem = 'public_pem';

    // 公钥
    public static $notifyUrl = 'notify_url';

    // 异步通知url
    public static $returnUrl = 'return_url';
    // 同步通知地址
}