<?php
// +----------------------------------------------------------------------
// | Electronic Commerce [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 米糕网络团队<13052079525> All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 米糕网络团队<13052079525>
// +----------------------------------------------------------------------
// | Author: 米糕网络团队 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace App\Common\FieldMapping;

class StoreAuthMenu
{

    public static $id = 'id';
 // 编号
    public static $path = 'path';
 // 路径
    public static $redirect = 'redirect';
 // 跳转路由
    public static $name = 'name';
 // 路由名称
    public static $component = 'component';
 // 组件
    public static $createTime = 'create_time';
 // 添加日期
    public static $updateTime = 'update_time';
 // 更新日期
    public static $fid = 'fid';
 // 父级编号
    public static $remark = 'remark';
 // 备注
    public static $status = 'status';
 // 状态【0隐藏，1显示】
    public static $condition = 'condition';
 // 条件
    public static $sort = 'sort'; // 排序
}