<?php
// +----------------------------------------------------------------------
// | Electronic Commerce [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 米糕网络团队<13052079525> All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 米糕网络团队<13052079525>
// +----------------------------------------------------------------------
// | Author: 米糕网络团队 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace App\Common\FieldMapping;

class StoreArticle
{

    public static $id = 'id';
 // 文章编号
    public static $title = 'title';
 // 文章标题
    public static $categoryId = 'category_id';
 // 文章分类编号
    public static $keyword = 'keyword';
 // 关键字
    public static $source = 'source';
 // 文章来源
    public static $pic = 'pic';
 // 文章缩略图
    public static $recommend = 'recommend';
 // 是否推荐 0为不推荐 1为推荐
    public static $display = 'display';
 // 是否显示 1为显示 0为不显示
    public static $intro = 'intro';
 // 文章摘要
    public static $content = 'content';
 // 文章内容
    public static $sort = 'sort'; // 文章排序
}