<?php
// +----------------------------------------------------------------------
// | Electronic Commerce [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 米糕网络团队<13052079525> All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 米糕网络团队<13052079525>
// +----------------------------------------------------------------------
// | Author: 米糕网络团队 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace App\Common\FieldMapping;

class StoreAdv
{

    public static $id = 'id';
 // 广告自增标识编号
    public static $apId = 'ap_id';
 // 广告位id
    public static $advTitle = 'adv_title';
 // 广告内容描述
    public static $advContent = 'adv_content';
 // 广告内容
    public static $adKey = 'ad_key';
 // 广告键
    public static $advStart_date = 'adv_start_date';
 // 广告开始时间
    public static $advEnd_date = 'adv_end_date';
 // 广告结束时间
    public static $slideSort = 'slide_sort';
 // 幻灯片排序
    public static $storeId = 'store_id';
 // 店铺【ID】
    public static $clickNum = 'click_num';
 // 广告点击率
    public static $isAllow = 'is_allow';
 // 会员购买的广告是否通过审核【0未审核1审核已通过2审核未通过】
    public static $buyStyle = 'buy_style';
 // 购买方式
    public static $goldpay = 'goldpay';
 // 购买所支付的金币
    public static $createTime = 'create_time';
 // 添加时间
    public static $updateTime = 'update_time';
 // 更新时间
    public static $adUrl = 'ad_url';
 // 广告链接
    public static $status = 'status'; // 是否显示0显示1不显示
}