<?php
// +----------------------------------------------------------------------
// | Electronic Commerce [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 米糕网络团队<13052079525> All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 米糕网络团队<13052079525>
// +----------------------------------------------------------------------
// | Author: 米糕网络团队 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace App\Common\FieldMapping;

class StoreInformation
{

    public static $id = 'id';
 // 编号
    public static $storeId = 'store_id';
 // 公司入驻表编号
    public static $shopAccount = 'shop_account';
 // 商家账号
    public static $shopName = 'shop_name';
 // 店铺名称
    public static $levelId = 'level_id';
 // 店铺等级
    public static $shopLong = 'shop_long';
 // 开店时长
    public static $shopClass = 'shop_class';
 // 店铺分类
    public static $scBail = 'sc_bail';
 // 店铺分类保证金
    public static $payingCertificate = 'paying_certificate';
 // 付款凭证
    public static $payingCertif = 'paying_certif';
 // 付款凭证说明
    public static $status = 'status';
 // 入驻类型 0个人入住 1 企业入驻
    public static $createTime = 'create_time';
 // 创建时间
    public static $updateTime = 'update_time'; // 更新时间
}