<?php
// +----------------------------------------------------------------------
// | Electronic Commerce [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 米糕网络团队<13052079525> All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 米糕网络团队<13052079525>
// +----------------------------------------------------------------------
// | Author: 米糕网络团队 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace App\Common\FieldMapping;

class Announcement
{

    public static $id = 'id';
 // 公告id
    public static $title = 'title';
 // 公告标题
    public static $adminAccount = 'admin_account';
 // 作者
    public static $intro = 'intro';
 // 公告简介
    public static $content = 'content';
 // 公告内容
    public static $createTime = 'create_time';
 // 公告创建时间
    public static $updateTime = 'update_time';
 // 公告最后一次编辑时间
    public static $type = 'type';
 // 公告类型 默认：0不选 1新
    public static $status = 'status';
 // 显示状态 0不显示 默认：1显示
    public static $sort = 'sort'; // 排序 默认:50
}