<?php
// +----------------------------------------------------------------------
// | Electronic Commerce [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 米糕网络团队<13052079525> All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 米糕网络团队<13052079525>
// +----------------------------------------------------------------------
// | Author: 米糕网络团队 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace App\Common\FieldMapping;

class CapitaInvoice
{

    public static $id = 'id';
 // 编号
    public static $ein = 'ein';
 // 税号
    public static $openingBank = 'opening_bank';
 // 开户行
    public static $bankAccount = 'bank_account';
 // 开户行账号
    public static $provId = 'prov_id';
 // 省份
    public static $cityId = 'city_id';
 // 市
    public static $distId = 'dist_id';
 // 区
    public static $registerAddress = 'register_address';
 // 注册地址
    public static $registerTel = 'register_tel';
 // 注册电话
    public static $userId = 'user_id';
 // 用户[编号]
    public static $createTime = 'create_time';
 // 添加时间
    public static $updateTime = 'update_time';
 // 更新时间
    public static $companyName = 'company_name'; // 公司名称
}