<?php
// +----------------------------------------------------------------------
// | Electronic Commerce [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 米糕网络团队<13052079525> All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 米糕网络团队<13052079525>
// +----------------------------------------------------------------------
// | Author: 米糕网络团队 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace App\Common\FieldMapping;

class CashWithdrawal
{

    public static $id = 'id';
 // id
    public static $userId = 'user_id';
 // 用户【id】
    public static $account = 'account';
 // 提现账号
    public static $money = 'money';
 // 提现金额
    public static $status = 'status';
 // 状态【0 审核中，1 审核成功，2 审核失败，3 提现成功】
    public static $cashType = 'cash_type';
 // 提现方式【例如支付宝】
    public static $platformType = 'platform_type';
 // 平台类型【0 PC， 1 mobile 2微商城】
    public static $createTime = 'create_time';
 // 添加时间
    public static $updateTime = 'update_time';
 // 最后修改时间
    public static $approvalMessage = 'approval_message';
 // 审核消息
    public static $orderSn = 'order_sn';
 // 提现订单号
    public static $alipayOrder = 'alipay_order';
 // 支付宝订单号
    public static $successTime = 'success_time';
 // 提现完成时间
    public static $approvalId = 'approval_id';
 // 审核人【编号】
    public static $approvalName = 'approval_name'; // 审核人【账号，适当冗余】
}