<?php
// +----------------------------------------------------------------------
// | Electronic Commerce [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 米糕网络团队<13052079525> All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 米糕网络团队<13052079525>
// +----------------------------------------------------------------------
// | Author: 米糕网络团队 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace App\Common\FieldMapping;

class ComplainTalk
{

    public static $talkId = 'talk_id';
 // 投诉对话id
    public static $complainId = 'complain_id';
 // 投诉id
    public static $talkMember_id = 'talk_member_id';
 // 发言人id
    public static $talkMember_name = 'talk_member_name';
 // 发言人名称
    public static $talkMember_type = 'talk_member_type';
 // 发言人类型(1-投诉人/2-被投诉人/3-平台)
    public static $talkContent = 'talk_content';
 // 发言内容
    public static $talkState = 'talk_state';
 // 发言状态(1-显示/2-不显示)
    public static $talkAdmin = 'talk_admin';
 // 对话管理员，屏蔽对话人的id
    public static $talkDatetime = 'talk_datetime'; // 对话发表时间
}