<?php
// +----------------------------------------------------------------------
// | Electronic Commerce [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 米糕网络团队<13052079525> All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 米糕网络团队<13052079525>
// +----------------------------------------------------------------------
// | Author: 米糕网络团队 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace App\Common\FieldMapping;

class GoodsClass
{

    public static $id = 'id';
 // id
    public static $className = 'class_name';
 // 分类名字
    public static $createTime = 'create_time';
 // 创建时间
    public static $sortNum = 'sort_num';
 // 排序
    public static $updateTime = 'update_time';
 // 更新时间
    public static $hideStatus = 'hide_status';
 // 是否显示【1 显示 0隐藏】
    public static $picUrl = 'pic_url';
 // 图片
    public static $fid = 'fid';
 // 父id
    public static $type = 'type';
 // 分类类型
    public static $shoutui = 'shoutui';
 // 是否推荐【1 为推荐 0为不推荐】
    public static $isShow_nav = 'is_show_nav';
 // 是否显示在导航栏0：是；1：否
    public static $description = 'description';
 // 分类介绍
    public static $cssClass = 'css_class';
 // css样式
    public static $pcUrl = 'pc_url'; // pc 广告分类图
}