<?php
// +----------------------------------------------------------------------
// | Electronic Commerce [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 米糕网络团队<13052079525> All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 米糕网络团队<13052079525>
// +----------------------------------------------------------------------
// | Author: 米糕网络团队 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace App\Common\FieldMapping;

class GoodsAttribute
{

    public static $id = 'id';
 // 属性id
    public static $attrName = 'attr_name';
 // 属性名称
    public static $classOne = 'class_one';
 // 一级分类
    public static $classTwo = 'class_two';
 // 二级分类
    public static $classThree = 'class_three';
 // 三级分类
    public static $attrIndex = 'attr_index';
 // 0不需要检索 1关键字检索
    public static $attrType = 'attr_type';
 // 0唯一属性 1单选属性 2复选属性
    public static $inputType = 'input_type';
 // 0 手工录入 1从列表中选择 2多行文本框
    public static $attrValues = 'attr_values';
 // 可选值列表
    public static $orderSort = 'order_sort';
 // 属性排序
    public static $createTime = 'create_time';
 // 创建时间
    public static $updateTime = 'update_time'; // 更新时间
}