<?php
// +----------------------------------------------------------------------
// | Electronic Commerce [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 米糕网络团队<13052079525> All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 米糕网络团队<13052079525>
// +----------------------------------------------------------------------
// | Author: 米糕网络团队 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace App\Common\FieldMapping;

class OpenShopOrder
{

    public static $id = 'id';
 // 编号
    public static $orderSn = 'order_sn';
 // 订单标志
    public static $userId = 'user_id';
 // 用户
    public static $createTime = 'create_time';
 // 创建时间
    public static $payTime = 'pay_time';
 // 支付时间
    public static $storeId = 'store_id';
 // 店铺
    public static $type = 'type';
 // 类型【0个人入住1 企业入住】
    public static $payType = 'pay_type';
 // 支付类型
    public static $payPlatform = 'pay_platform';
 // 支付平台【 0pc 1 wap 2 app， 3微商城】
    public static $orderStatus = 'order_status'; // 支付状态 【0 未支付 1已支付】
}