<?php
// +----------------------------------------------------------------------
// | Electronic Commerce [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 米糕网络团队<13052079525> All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 米糕网络团队<13052079525>
// +----------------------------------------------------------------------
// | Author: 米糕网络团队 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace App\Common\FieldMapping;

class OrderComment
{

    public static $id = 'id';
 // id
    public static $goodsId = 'goods_id';
 // 商品【编号】
    public static $orderId = 'order_id';
 // 订单【编号】
    public static $userId = 'user_id';
 // 用户【编号】
    public static $status = 'status';
 // 是否可见【1可见, 0.不可见】
    public static $content = 'content';
 // 评论内容
    public static $createTime = 'create_time';
 // 评论时间
    public static $anonymous = 'anonymous';
 // 是否匿名【 0.是 1.否】
    public static $score = 'score';
 // 评分【 1-5】
    public static $level = 'level';
 // 评级【 0.差评(1,2分) 1.一般(3,4分) 2.好评(5分)】
    public static $labels = 'labels';
 // 评论标签【0 手感好, 1 发货快 2 物美价廉 3 性价比高】
    public static $anwser = 'anwser';
 // 评论回复
    public static $havePic = 'have_pic';
 // 是否有图片【0没有,1有】
    public static $storeId = 'store_id'; // 店铺【编号】
}