<?php
// +----------------------------------------------------------------------
// | Electronic Commerce [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 米糕网络团队<13052079525> All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 米糕网络团队<13052079525>
// +----------------------------------------------------------------------
// | Author: 米糕网络团队 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace App\Common\FieldMapping;

class StorePerson
{

    public static $id = 'id';
 // 主键编号
    public static $userId = 'user_id';
 // 用户编号
    public static $storeName = 'store_name';
 // 店铺名称
    public static $personName = 'person_name';
 // 姓名
    public static $idCard = 'id_card';
 // 身份证号码
    public static $idcardPositive = 'idcard_positive';
 // 身份证正面
    public static $otherSide = 'other_side';
 // 身份证反面
    public static $bankName = 'bank_name';
 // 银行名称
    public static $bankAccount = 'bank_account';
 // 银行账号
    public static $createTime = 'create_time';
 // 创建时间
    public static $updateTime = 'update_time';
 // 更新时间
    public static $status = 'status';
 // 申请状态 【0-已提交申请 1-缴费完成 2-审核成功 3-审核失败 4-缴费审核失败 5-审核通过开店】
    public static $mobile = 'mobile';
 // 联系人电话
    public static $alipayAccount = 'alipay_account';
 // 支付宝支付账号
    public static $wxAccount = 'wx_account'; // 微信支付账号
}