<?php
// +----------------------------------------------------------------------
// | Electronic Commerce [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 米糕网络团队<13052079525> All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 米糕网络团队<13052079525>
// +----------------------------------------------------------------------
// | Author: 米糕网络团队 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace App\Common\FieldMapping;

class StoreMemberLevel
{

    public static $id = 'id';
 // 编号
    public static $levelId = 'level_id';
 // 【平台设置的】店铺会员等级【编号】
    public static $discount = 'discount';
 // 折扣
    public static $conditionMoney = 'condition_money';
 // 金额条件【弃用】
    public static $conditionNum = 'condition_num';
 // 交易笔数下限
    public static $createTime = 'create_time';
 // 创建时间
    public static $updateTime = 'update_time';
 // 更新时间
    public static $storeId = 'store_id';
 // 店铺【编号】
    public static $moneyBig = 'money_big';
 // 金额上限
    public static $moneySmall = 'money_small';
 // 金额下限
    public static $numBig = 'num_big'; // 交易笔数上限
}