<?php
// +----------------------------------------------------------------------
// | Electronic Commerce [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 米糕网络团队<13052079525> All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 米糕网络团队<13052079525>
// +----------------------------------------------------------------------
// | Author: 米糕网络团队 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace App\Common\FieldMapping;

class StoreGrade
{

    public static $id = 'id';
 // 索引ID
    public static $levelName = 'level_name';
 // 等级名称
    public static $goodsLimit = 'goods_limit';
 // 允许发布的商品数量
    public static $albumList = 'album_list';
 // 允许上传图片数量
    public static $spaceLimit = 'space_limit';
 // 上传空间大小【单位MB】
    public static $templateNumber = 'template_number';
 // 选择店铺模板套数
    public static $price = 'price';
 // 开店费用(元/年)
    public static $description = 'description';
 // 申请说明
    public static $upperLimit = 'upper_limit';
 // 销售上限
    public static $lowerLimit = 'lower_limit';
 // 销售下限金额
    public static $status = 'status';
 // 是否启用【0否1是】
    public static $createTime = 'create_time';
 // 创建时间
    public static $updateTime = 'update_time'; // 更新时间
}