<?php
// +----------------------------------------------------------------------
// | Electronic Commerce [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 米糕网络团队<13052079525> All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 米糕网络团队<13052079525>
// +----------------------------------------------------------------------
// | Author: 米糕网络团队 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace App\Common\FieldMapping;

class StoreSeller
{

    public static $id = 'id';
 // 卖家编号
    public static $sellerName = 'seller_name';
 // 卖家用户名
    public static $userId = 'user_id';
 // 用户编号
    public static $groupId = 'group_id';
 // 卖家组编号
    public static $storeId = 'store_id';
 // 店铺编号
    public static $isAdmin = 'is_admin';
 // 是否管理员(0-不是 1-是)
    public static $sellerQuicklink = 'seller_quicklink';
 // 卖家快捷操作
    public static $lastLogin_time = 'last_login_time';
 // 最后登录时间
    public static $isClient = 'is_client';
 // 是否客户端用户 0-否 1-是
    public static $lastLogin_ip = 'last_login_ip';
 // 最后登录ip
    public static $loginNum = 'login_num';
 // 登录次数
    public static $status = 'status';
 // 0正常1禁用
    public static $createTime = 'create_time';
 // 添加时间
    public static $updateTime = 'update_time';
 // 更新时间
    public static $password = 'password'; // 登录密码
}