<?php
// +----------------------------------------------------------------------
// | Electronic Commerce [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 米糕网络团队<13052079525> All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 米糕网络团队<13052079525>
// +----------------------------------------------------------------------
// | Author: 米糕网络团队 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace App\Common\FieldMapping;

class UserAuths
{

    public static $id = 'id';
 // id
    public static $userId = 'user_id';
 // 用户id
    public static $identityType = 'identity_type';
 // 登录类型:0.支付宝登陆,1.qq登录2.微信登录,3.微博登录
    public static $identifier = 'identifier';
 // 账户:如果是第三方登陆就是第三方用户唯一标识
    public static $credential = 'credential';
 // 密码:如果是第三方登录就是第三方的access_tooken
    public static $expiresIn = 'expires_in';
 // 第三方登录时的超期时间,本网站注册用户即为0
    public static $updateAt = 'update_at';
 // 更新密码的时间
    public static $createAt = 'create_at';
 // 创建时间
    public static $local = 'local';
 // 账户登录类型:1.本地登录 0.三方登陆
    public static $refreshToken = 'refresh_token';
 // 授权更新
    public static $unionid = 'unionid'; // 微商城【打通一个企业对应多个公众号】
}