<?php
// +----------------------------------------------------------------------
// | Electronic Commerce [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 米糕网络团队<13052079525> All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 米糕网络团队<13052079525>
// +----------------------------------------------------------------------
// | Author: 米糕网络团队 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace App\Common\FieldMapping;

class WaybillPrintData
{

    public static $id = 'id';
 //
    public static $printId = 'print_id';
 // 打印项编号
    public static $waybillId = 'waybill_id';
 // 运单【编号】
    public static $printItem = 'print_item';
 // 打印项
    public static $dialogLeft = 'dialog_left';
 // 做偏移量（毫米）
    public static $dialogWidth = 'dialog_width';
 // 宽度偏移量
    public static $dialogHeight = 'dialog_height';
 // 高度偏移量（毫米）
    public static $dialogTop = 'dialog_top';
 // 上偏移量（毫米）
    public static $status = 'status';
 // 状态【0 废弃 1打印】
    public static $createTime = 'create_time';
 // 创建时间
    public static $updateTime = 'update_time'; // 更新时间
}